select *
from (
select *
from TN_GOODS_OPTION
where GOODS_SQ in (
	select GOODS_SQ
	from TN_GOODS_OPTION
	where GOODS_OPTION_CD in (59,60,63,64)
)
) A left outer join TN_GOODS_OPTION B on A.GOODS_SQ=B.GOODS_SQ and A.GOODS_OPTION_CD








mysql> mysql> select * from TN_GOODS_OPTIONS where GOODS_SQ=4988 and GOODS_OPTION_CD in (59,60,63,64);
+------------------+----------+-----------------+--------------+------------+-----------+-----------+-----------------+-----------------+---------------------+
| GOODS_OPTIONS_SQ | GOODS_SQ | GOODS_OPTION_CD | AUTHOR_SE_CD | CMGR_SE_CD | REGIST_DE | TRMNAT_DE | TRIAL_REGIST_DE | TRIAL_TRMNAT_DE | LAST_REGIST_DE      |
+------------------+----------+-----------------+--------------+------------+-----------+-----------+-----------------+-----------------+---------------------+
|           190745 |     4988 | 59              | 104          | 003        | NULL      | NULL      | NULL            | NULL            | 2017-10-19 14:15:36 |
|           190750 |     4988 | 60              | 104          | 003        | NULL      | NULL      | NULL            | NULL            | 2017-10-19 14:15:36 |
|           190747 |     4988 | 63              | 104          | 003        | NULL      | NULL      | NULL            | NULL            | 2017-10-19 14:15:36 |
|           190740 |     4988 | 64              | 104          | 003        | NULL      | NULL      | NULL            | NULL            | 2017-10-19 14:15:36 |
+------------------+----------+-----------------+--------------+------------+-----------+-----------+-----------------+-----------------+---------------------+

select INSTT_SQ, INSTT_NM
from TN_INSTT
where INSTT_NM in ('디지비자산운용','케이비자산운용','엔에이치아문디자산운용','엔에이치투자증권','교보악사자산운용','동부자산운용','동양자산운용','마이다스에셋자산운용','메리츠종합금융증권','미래에셋자산운용','삼성자산운용','알리안츠생명','유리자산운용','유리치자산운용','이스트스프링자산운용코리아','트러스톤자산운용','하나유비에스자산운용','한국투자신탁운용','한화자산운용')
;


+----------+-----------------------------------------+
| INSTT_SQ | INSTT_NM                                |
+----------+-----------------------------------------+
|       68 | 교보악사자산운용                        |
|      119 | 동부자산운용                            |
|      124 | 동양자산운용                            |
|      258 | 디지비자산운용                          |
|      139 | 마이다스에셋자산운용                    |
|      150 | 메리츠종합금융증권                      |
|      159 | 미래에셋자산운용                        |
|      191 | 삼성자산운용                            |
|      240 | 알리안츠생명                            |
|      255 | 엔에이치아문디자산운용                  |
|      256 | 엔에이치투자증권                        |
|      277 | 유리자산운용                            |
|      278 | 유리치자산운용                          |
|      294 | 이스트스프링자산운용코리아              |
|      326 | 케이비자산운용                          |
|      343 | 트러스톤자산운용                        |
|      355 | 하나유비에스자산운용                    |
|      388 | 한국투자신탁운용                        |
|      396 | 한화자산운용                            |
+----------+-----------------------------------------+
	68,119,124,258,139,150,159,191,240,255,256,277,278,294,326,343,355,388,396


select goods_sq, pid
from TN_GOODS
where instt_sq in (
	select INSTT_SQ
	from TN_INSTT
	where INSTT_NM in ('디지비자산운용','케이비자산운용','엔에이치아문디자산운용','엔에이치투자증권','교보악사자산운용','동부자산운용','동양자산운용','마이다스에셋자산운용','메리츠종합금융증권','미래에셋자산운용','삼성자산운용','알리안츠생명','유리자산운용','유리치자산운용','이스트스프링자산운용코리아','트러스톤자산운용','하나유비에스자산운용','한국투자신탁운용','한화자산운용')
)
;

insert into TN_GOODS_OPTIONS(goods_sq, goods_option_cd, author_se_cd, cmgr_se_cd, regist_de, last_regist_de)
select
	goods_sq, 59 as goods_option_cd, 104 as author_se_cd, 
from
(
	
)
;



select * from TN_GOODS_OPTIONS where goods_sq=4988 and GOODS_OPTION_CD in (59,60,63,64);








맥쿼리투자신탁운용
멀티에셋자산운용
스팍스자산운용
신영증권
유진자산운용
키움투자자산운용
하이자산운용
한국투자증권







select g.GOODS_SQ, g.PID, i.INSTT_NM
from TN_GOODS g left outer join TN_INSTT i on g.INSTT_SQ=i.INSTT_SQ
where g.INSTT_SQ in (
	select INSTT_SQ
	from TN_INSTT
	where INSTT_NM in ('디지비자산운용','케이비자산운용','엔에이치아문디자산운용','엔에이치투자증권','교보악사자산운용','동부자산운용','동양자산운용','마이다스에셋자산운용','메리츠종합금융증권','미래에셋자산운용','삼성자산운용','알리안츠생명','유리자산운용','유리치자산운용','이스트스프링자산운용코리아','트러스톤자산운용','하나유비에스자산운용','한국투자신탁운용','한화자산운용')
)
order by i.INSTT_NM asc
;